[
  {
    "content": "6 The Constitution of Nepal Date of Publication in Nepal Gazette 20 September 2015 (2072.6.3) Preamble : We, the Sovere ign People of Nepal, Internalizing the people's sovereign right and right to autonomy and self -rule, while maintaining freedom, sovereignty, territorial integrity, national unity, independence and dignity of Nepal, Recalling the glorious history of historic people's movements, armed conflict, dedication and sacri fice undertaken by the Nepalese people at times for the interest of the nation, democracy and progressive changes , and respecting for the martyrs and disappeared and victim citizens, Ending all forms of discrimination and oppression created by the feudalis tic, autocratic, centralized, unitary system of governance, Protecting and promoting social and cultural solidarity, tolerance and harmony, and unity in diversity by recognizing the multi -ethnic, multi -lingual, multi -religious, multi -cultural and diverse r egional characteristics, resolving to build an egalitarian society founded on the propo rtional inclusive and participato ry principles in order to ensure economic equality, prosperity and social justice , by eliminating discrimination based on class, caste , region, language, religion and gender and all forms of caste - based untouchability , and Being committed to socialism based on democratic norms and values including the people's competitive multiparty democratic system of governance, civil liberties, fundamental rights, human rights, adult franchise, periodic elections, full freedom of the press, and independent, impartial and competent judiciary and concept of the rule of law, and build a prosperous nation, 7 Do hereby pass and promulgate this Constitution, through the Constituent Assembly, in order to fulfil the aspirations for sustainable peace, good governance, development and prosperity through the federal , democratic , republic an, system of governance. 8 Part-1 Preliminary 1. Constitution as the fundamen tal law: (1) This Constitution is the fundamental law of Nepal. Any law inconsistent with this Constitution shall, to the extent of such inconsistency, be void. (2) It shall be the duty of every person to observe this Constitution. Sovereignty and state a uthority : The sovereignty and state authority of Nepal shall be vested in the Nepalese people. It shall be exercised in accordance with the provisions set forth in this Constitution. Nation : All th e Nepalese people , with multiethnic, multilingua l, multi -religious, multicultural characteristics and in geographical diversities, and having common aspirations and being united by a bond of allegiance to national independence, territorial integrity, national interest and prosperity of Nepal, collective ly constitute the nation. State of Nepal : (1) Nepal is a n independent, indivisible, sovereign, secular, inclusive, democratic, socialism -oriented, federal democratic republican state. Explanation : For the purposes of this Article, \"secular\" means religious, cultural freedoms, including protection of religion, culture handed down from the time immemorial . (2) The territory of Nepal shall comprise: (a) the territory existing at the time of commencement of this Constitution, and (b) such other territo ry as may be acquired after the commencement of this Constitution. National interest : (1) Safeguarding of the freedom , sovereignty, territorial integrity, nationality, independence and dignity of Nepal , the rights of the 9 Nepalese people, border security, ec onomic wellbeing and prosperity shall be the basic elements of the national interest of Nepal. (2) Any conduct and act contrary to the national interest shall be punishable by the Federal law. Languages of the nation : All language s spoken as the mother tongues in Nepal are the languages of the nation. Official language : (1) The Nepali language in the Devnagari script shall be the official language of Nepal. (2) A State may, by a State law, determine one or more than one langu ages of the nation spoken by a majority of people within the State as its official language(s), in addition to the Nepali language. (3) Other matters relating to language shall be as decided by the Government of Nepal, on recommendation of the Language Commission. National f lag: (1) The national flag of Nepal consists of two juxtaposed triangular figures with a crimson -coloured base and deep blue borders, there being a white emblem of the crescent moon with eight rays visible out of sixteen in the upp er part and a white emblem of a twelve rayed sun in the lower part. (2) The method of drawing out the flag and other particulars relating thereto shall be as set forth in Schedule -1. National anthem etc : (1) The national anthem of Nepal shall be as set forth in Schedule -2. (2) The coat -of-arms of Nepal shall be as set forth in Schedule -3.",
    "source": "constitution.pdf",
    "chunk_index": 0,
    "token_count": 977,
    "char_count": 4863,
    "id": "adbdd03d-04bc-4573-ab61-fb8e5dc6d8af"
  },
  {
    "content": "a State law, determine one or more than one langu ages of the nation spoken by a majority of people within the State as its official language(s), in addition to the Nepali language. (3) Other matters relating to language shall be as decided by the Government of Nepal, on recommendation of the Language Commission. National f lag: (1) The national flag of Nepal consists of two juxtaposed triangular figures with a crimson -coloured base and deep blue borders, there being a white emblem of the crescent moon with eight rays visible out of sixteen in the upp er part and a white emblem of a twelve rayed sun in the lower part. (2) The method of drawing out the flag and other particulars relating thereto shall be as set forth in Schedule -1. National anthem etc : (1) The national anthem of Nepal shall be as set forth in Schedule -2. (2) The coat -of-arms of Nepal shall be as set forth in Schedule -3. (3) The Rhododendron Arboreum shall be the national flower, Crimson Colo ur shall be the national colo ur, the Cow shall be the national animal and the Lophophor us shall be the national bird of Nepal. 10 Part-2 Citizenship 10. Not to deprive of citizenship : (1) No citizen of Nepal may be deprived of the right to obtain citizenship. (2) There is a provision of single federal citizenship with State identity in Nepal. To be c itizens of Nepal : (1) The persons who have obtained the citizenship of Nepal at the time of commencement of this Constitution and who are qualified to obtain citizenship in accordance with this Part shall be the citizens of Nepal. (2) The following person who has his or her permanent domicile in Nepal at the time of commencement of this Constitution shall be the citizen of Nepal by descent: (a) a person who has obtained the citizenship of Nepal by descent prior to the commencement of th is Constitution, (b) a person whose father or mother was a citizen of Nepal at his or her birth. (3) A child of a citizen having obtained the citizenship of Nepal by birth prior to the commencement of Nepal shall, upon attaining majority, acquire the citiz enship of Nepal by descent if the child's father and mother both are citizens of Nepal. (4) Every minor who is found within Nepal and the whereabouts of whose father and mother are not known shall, until the father or the mother of the child is traced, be a citizen of Nepal by descent. (5) A person who is born in Nepal from a woman who is a citizen of Nepal and has resided in Nepal and whose father is not traced shall be provided with the citizenship of Nepal by descent. 11 Provided that his or her father is held to be a foreign citizen, the citizenship of such person shall be converted into naturalized citizenship as provided for in the Federal law. (6) A foreign woman who has a matrimonial relationship with a citizen of Nepal may, if she so wishes, acquire the naturalized citizenship of Nepal as provided for in the Federal law. (7) Notwithstanding anything contained elsewhere in this Article, in the case of a person born from a woman who is a citizen of Nepal and married to a foreign citizen , the person may acquire the naturalized citizenship of Nepal in accordance with the Federal law if h e or she has permanent ly resided in Nepal and has not acquired the citizenship of a foreign country. Provided that if such person's mother and father both are citizen s of Nepal at the time of acquisition of citizenship, such person born in Nepal may acquire the citizenship of Nepal by descent. (8) In the cases other than those mentioned in this Article, the Government of Nepal may, in accordance with the Federal law, grant the naturalized citizenship of Nepal. (9) The Government of Nepal may, in accordance with the Federal law, grant the honorary citizenship of Nepal. (10) Whenever any territory is acquired by way of merger into Nepal, a person having his or her d omicile in such territory shall become a citizen of Nepal, subject to the Federal law. Citizenship with identity of descent and g ender : A person who obtains the citizenship of Nepal by descent in accordance with this Constitution may obtain a certifi cate of citizenship of Nepal with gender identity by the name of his or her mother or father. Acquisition, reacquisition and termination of citizenship : Other matters relating to the acquisition, reacquisition and termination of citizenship shall be as provided for in the Federal law.",
    "source": "constitution.pdf",
    "chunk_index": 1,
    "token_count": 927,
    "char_count": 4410,
    "id": "2402a93a-9b48-4115-b3c8-d92844bc6559"
  },
  {
    "content": "acquisition of citizenship, such person born in Nepal may acquire the citizenship of Nepal by descent. (8) In the cases other than those mentioned in this Article, the Government of Nepal may, in accordance with the Federal law, grant the naturalized citizenship of Nepal. (9) The Government of Nepal may, in accordance with the Federal law, grant the honorary citizenship of Nepal. (10) Whenever any territory is acquired by way of merger into Nepal, a person having his or her d omicile in such territory shall become a citizen of Nepal, subject to the Federal law. Citizenship with identity of descent and g ender : A person who obtains the citizenship of Nepal by descent in accordance with this Constitution may obtain a certifi cate of citizenship of Nepal with gender identity by the name of his or her mother or father. Acquisition, reacquisition and termination of citizenship : Other matters relating to the acquisition, reacquisition and termination of citizenship shall be as provided for in the Federal law. Power to grant non-resident Nepalese citizenship : The non-residential citizenship of Nepal may be so granted to a person who has acquired the citizenship of a foreign country, has reside d in a country other than a member state of the South Asian Association for Regional Coope ration, and who or whose father or mother , grandfather or grandmother was prev iously a citizen of Nepal by decent or birth but subsequently acquired the citizenship of the foreign country that such person may enjoy economic, social and cultural rights in accordance with the Federal law . Other provisions relating to citizenship o f Nepal : Other matters relating to the maintenance of records setting out the identity of every citizen of Nepal and the citizenshi p of Nepal shall be as provided for in the Federal law.",
    "source": "constitution.pdf",
    "chunk_index": 2,
    "token_count": 351,
    "char_count": 1823,
    "id": "0b772fe5-e62e-4f09-9bfd-3b1fe57a278b"
  }
]