[
  {
    "content": "Anshan Paradox Economic Implications of Medical Education Reforms in Nepal Research: Prabesh Rijal (Jr. Research Assistant, IIDS)  Arju Pokharel (Research Assistant,IIDS) Executive Summary The Dr. Anshan Paradox examines Nepals medical education reforms, driven by Dr. Govinda KCs relentless activism. His movement led to the enactment of the National Medical Education Act (2018), establishing the Medical Education Commission (MEC). Key successes include standardized tuition fees, a single Common Entrance Exam (CEE) to curb corruption, and expanded scholarshipswith public college scholarships surging by 238.3 in comparison to 2014 in present worth. Additionally, decentralization efforts ensured every province now has a public medical college, improving accessibility. However, these gains came with unintended economic trade-offs, including shrinking private sector participation, socio-contextual issues, decline in seats, and declining foreign investment. The Burden of Scholarships reveals stark disparities: public institutions saw a 238.3 surge in scholarship seats and 68.2 growth in total seats, while private colleges faced a 13.5 decline in both scholarship and total seats. This shift created a 76.4 increase in total scholarship costs in public colleges despite a 0.74 decrease in overall seats in the country. The financial strain is acute medical education scholarship consumes 69.2 (NPR 5.11 arab) of Nepal's total education scholarship budget(NPR 7.38 arab) 100x higher than general program scholarship costs. MBBS scholarship alone estimates to cost 23.4 of total medical scholarship (NPR 1.73 arab) for just 389 students Overregulation has stifled private sector growth, with seat caps (150 to 100), rigid infrastructure rules (300-bed mandate), and fee controls reducing investment appeal. Only one new private college opened post-reform versus four public institutions, skewing the public-private ratio to 4:1 against Dr. KC's advocated 1:3. Foreign investment remains stagnant, with just two foreign-funded colleges operating since the 1990s. This contrasts sharply with India's 110 MBBS seat growth (2014-2023) versus Nepal's 0.74 decline. Policy, when faced with socio-economic circumstances, faces huge strains, especially when you invest so much in making human capital and the trend of brain drain is massive in that field. 70 to 93.7 of new doctors emigrated in recent years, creating an estimated NPR 176 crore annual loss in training costs. Parallel declines in nursing education (49 enrollment drop, 78 closures, NPR 5.85 billion lost investment) exacerbate workforce shortages. Strict hospital ownership rules (Section 44) have forced closures rather than enabling public-private collaboration, while foreign student potential (per Section 17(5)) remains untapped due to seat limitations. 1 Prabesh Rijal To address these challenges, Nepal must recalibrate its approach. Expanding private college seat allocations, revising inflexible infrastructure mandates, and reallocating scholarship funds to high- demand fields like nursing could optimize resources. Encouraging public-private partnerships and calibrating service bonds for scholarship recipients may curb brain drain while ensuring healthcare access. Without such adjustments, the current system risks perpetuating a cycle of high costs and low retentionwhere reforms aimed at equity inadvertently compromise long-term viability. Anshan Paradox thus underscores a critical lesson: balancing ethical rigor with economic pragmatism is essential for Nepals medical education future. Introduction Dr. Govinda KCs series of hunger strikes, from 2012 to his 23rd strike in 2024, was driven by his unwavering commitment to reforming Nepals medical education system. He advocated for transparency in admissions, regulation of fees, increased scholarships, greater accessibility to medical education, and stricter regulations on the affiliation of medical institutions. KC believed that Nepals medical education system was at risk due to non-credible investors, including members of parliament, political leaders, and influential businessmen, who saw for-profit medical schools as a quick and effortless way to generate profits. He argued that the absence of an effective and impartial central authority allowed this issue to persist without proper regulation (Bhattarai, B., 2020) . KCs activism led to the enactment of the National Medical Education Act (2018) , resulting in the establishment of the Medical Education Commission. While this reform introduced structured oversight, reports of its negative economic consequences emergedparticularly highlighting challenges faced by private colleges, such as institutional closures and limited accessibility. Additionally, concerns over rising scholarship costs, financial pressure on private institutions due to overregulation, a declining private sector, and inefficient resource utilization became policy-level concerns (Nepal Press, 2023) . This report examines both the positive impacts and the economic costs of these reforms.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 0,
    "token_count": 990,
    "char_count": 5069,
    "id": "e931de02-611e-4d62-a279-8fe78bd0f35b"
  },
  {
    "content": "affiliation of medical institutions. KC believed that Nepals medical education system was at risk due to non-credible investors, including members of parliament, political leaders, and influential businessmen, who saw for-profit medical schools as a quick and effortless way to generate profits. He argued that the absence of an effective and impartial central authority allowed this issue to persist without proper regulation (Bhattarai, B., 2020) . KCs activism led to the enactment of the National Medical Education Act (2018) , resulting in the establishment of the Medical Education Commission. While this reform introduced structured oversight, reports of its negative economic consequences emergedparticularly highlighting challenges faced by private colleges, such as institutional closures and limited accessibility. Additionally, concerns over rising scholarship costs, financial pressure on private institutions due to overregulation, a declining private sector, and inefficient resource utilization became policy-level concerns (Nepal Press, 2023) . This report examines both the positive impacts and the economic costs of these reforms. The Anshan Paradox lies in the tension between ethical reform and economic feasibility. Given the socio-economic context, can Nepal sustain these sudden reforms without straining its economy? Additionally, how have these policies impacted medical education institutions and the broader healthcare sector? This report aims to address these key questions. Objectives The objectives of this report are to: 1.Analyze the Economic Impact of Dr. KCs Reforms: Evaluate the sustainability of scholarships, seat progression, nonprofit mandates, and the overall economic effects within the context of Nepals socio-economic environment, while highlighting the positive outcomes. 2 Prabesh Rijal 2.Assess Overregulation in Private Medical Colleges: Investigate the impact of regulations on obtaining letters of intent, including college closures, resource inefficiency, and discouraged private investment, while also considering any positive outcomes resulting from these reforms. 3.Examine the Impact of Government Expenditure: Assess the implications of increased public expenditure in medical education, taking into account Nepal's socio-economic and political context, including challenges such as brain drain. 4.Provide Policy Recommendations: Suggest strategies to balance ethical reforms with the long-term economic sustainability of Nepals medical education system, incorporating public-private partnerships (PPP). Demands During Activism These are some of the key demands made by Dr. KC throughout his protests, many of which have significant economic implications. This report analyzes these demands, highlighting their outcomes and evaluating their potential impact on the future sustainability of Nepal's medical education system. 1)Formation of the National Medical Education Act (NMEA 2018) and the Medical Education Commission (MEC). 2)Regulation of medical fees and transparency in admissions. 3)Decentralization and increased accessibility of medical colleges. 4)Expansion of scholarship seats. 5)Implementation of a single, transparent Common Entrance Exam. 6)Free tuition for MD/MS programs in government colleges for Nepali students. 7)Maintaining a 1:3 ratio between public and private medical colleges. 8)Establishment of a separate university for medical sciences. 9)Transition of medical institutions to non-profit status by 2085. 10) Strict regulations on affiliations to private colleges. 11) Reduction in total MBBS seats to improve quality. Sources: Gautam, D. (2022) , Khabarhub (2024), Gautam, M. 3 Prabesh Rijal Positive Impacts of Dr. KC's Advocacy 1.Advocacy and Enactment of the National Medical Education Act (NMEA 2018)  Medical Education Commission (MEC) Dr. KC's continuous protests led to the enactment of the National Medical Education Act, establishing a legal framework for regulating medical education. The Medical Education Commission (MEC) was formed to ensure quality, accessibility, and fairness in medical education policies, including fee structures. This body now oversees all aspects of medical education, including seat allocations, fee regulations, and scholarship policies. 2.Regulation of Medical Fees and Transparency in Admissions Before the NMEA and related reforms, private medical colleges often imposed arbitrary fees, creating significant financial burdens for students. In some cases, additional charges reached as high as 17 lakhs, an issue raised by Dr. Following the formation of the commission, many colleges were compelled to refund these excessive charges (Baral, B., 2019). The fee structure was standardized across institutions, ensuring uniformity for colleges both inside and outside Kathmandu Valley. Currently, tuition fees are 41,68,090 NPR in Kathmandu Valley and 45,95,720 NPR outside, as per the Medical Education Commission (2024). Scientific fee structures were introduced, improving the affordability and transparency of medical education. This is outlined in Section 18 of the NMEA . 3.Decentralization  Increased Accessibility of Medical Colleges Dr. KCs advocacy led to an increase in the number of public medical colleges outside Kathmandu, improving accessibility.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 1,
    "token_count": 1016,
    "char_count": 5290,
    "id": "7fb52acd-8f55-45bb-b498-cfa39d2abc56"
  },
  {
    "content": "ulation of Medical Fees and Transparency in Admissions Before the NMEA and related reforms, private medical colleges often imposed arbitrary fees, creating significant financial burdens for students. In some cases, additional charges reached as high as 17 lakhs, an issue raised by Dr. Following the formation of the commission, many colleges were compelled to refund these excessive charges (Baral, B., 2019). The fee structure was standardized across institutions, ensuring uniformity for colleges both inside and outside Kathmandu Valley. Currently, tuition fees are 41,68,090 NPR in Kathmandu Valley and 45,95,720 NPR outside, as per the Medical Education Commission (2024). Scientific fee structures were introduced, improving the affordability and transparency of medical education. This is outlined in Section 18 of the NMEA . 3.Decentralization  Increased Accessibility of Medical Colleges Dr. KCs advocacy led to an increase in the number of public medical colleges outside Kathmandu, improving accessibility. With the operation of Geta Medical College in Kailali, every province will now have a public medical college. The NMEA mandates the establishment of public medical colleges in provinces lacking one, to be completed within five years of the Acts implementation. Section 12(2) limits the establishment of medical institutions in urban areas, particularly in Kathmandu Valley, as Dr. KC demanded, promoting decentralization and regional equality in MBBS program. 4 Prabesh Rijal 4.Expansion of Scholarship Seats Dr. KC demanded an increase in scholarships, particularly in public colleges. The NMEA established a structured and transparent system for scholarships, creating a legal framework and clear guidelines for their allocation. Currently, 75 of seats in government medical colleges and 10-20 in private colleges are reserved for scholarships, making medical education more accessible to underprivileged students ( Section 17[7]). 5.Implementation of a Single, Transparent Common Entrance Exam Previously, multiple university- and academy-specific entrance exams led to unfair selection practices and corruption in admissions, which sparked Dr. KC's series of hunger strikes. He demanded a single, transparent system for admissions. Section 16 of the NMEA mandates a single Common Entrance Examination (CEE) , ensuring fairness and transparency in the admission process for medical colleges. 6.Free Tuition for MD/MS in Government Colleges Dr. KCs advocacy resulted in the provision of free tuition for Nepali students pursuing MD/MS in government medical colleges, improving access and affordability for postgraduate medical education ( Section 18[3]). Other Demands with Policy Outcomes Dr. KC called for maintaining a 1:3 ratio between public and private medical colleges . He advocated for the creation of a separate university dedicated to medical sciences , a provision reflected in Section 46 of the NMEA . KC demanded that medical institutions transition to non-profit status , a requirement included in Section 47 of the NMEA , which mandates institutions to become non-profit by 2085, with the option to transfer ownership to the government. Strict regulations on affiliations to private colleges were introduced, including requirements for medical institutions to have a 300-bed hospital (for medical programs) and a 100-bed facility (for dental and nursing programs), as outlined in Section 12(1)(a) of the NMEA . KC pushed for a reduction in the total MBBS seats per institution , lowering the maximum from 150 to 100 (see Annex 1). 5 Prabesh Rijal The Cost of Change Although the reforms have enhanced accessibility, especially through the decentralization of colleges, and increased scholarship opportunities for students, particularly in the MBBS program, they have also imposed significant economic pressure on key stakeholders, including medical institutions, the government, and the private sector. This section examines the key economic paradoxes: 1.The Burden of Scholarships : The synergy of increased scholarships and reduced total seats. 2.Overregulation  Ignored Private Sector : More restrictions, fewer opportunities. 3.Investing in Departure : Investment vs Braindrain. 4.Decline of Nursing colleges: Impact on certificate level medical education. 5.Lost Leverage: Underutilized Hospitals and missed revenue opportunities. The Burden of Scholarships : The landscape of MBBS scholarships in Nepal has undergone a significant transformation following the implementation of the National Medical Education Act (NMEA). Table1: Scholarship and Seats before and after reform. TypeScholarship Seats 2014 Total Seats 2014 Scholarship Seats 2025 Total Seats 2025 Private207 1,820 179 1,575 Public115 336 389 565 Total322 2,156 568 2,140 Source: MEC(2025) For details see Annex1 The data highlights contrasting trends in scholarship and total seats between 2014 and 2025 across private and public institutions.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 2,
    "token_count": 990,
    "char_count": 4949,
    "id": "eb0c6f1c-8419-4a4c-bf1e-a60d2901c91a"
  },
  {
    "content": "2.Overregulation  Ignored Private Sector : More restrictions, fewer opportunities. 3.Investing in Departure : Investment vs Braindrain. 4.Decline of Nursing colleges: Impact on certificate level medical education. 5.Lost Leverage: Underutilized Hospitals and missed revenue opportunities. The Burden of Scholarships : The landscape of MBBS scholarships in Nepal has undergone a significant transformation following the implementation of the National Medical Education Act (NMEA). Table1: Scholarship and Seats before and after reform. TypeScholarship Seats 2014 Total Seats 2014 Scholarship Seats 2025 Total Seats 2025 Private207 1,820 179 1,575 Public115 336 389 565 Total322 2,156 568 2,140 Source: MEC(2025) For details see Annex1 The data highlights contrasting trends in scholarship and total seats between 2014 and 2025 across private and public institutions. Public institutions experienced a dramatic 238.3 surge in scholarship seats (from 115 to 389) and a 68.2 increase in total seats (from 336 to 565). In contrast, private institutions saw a 13.5 decline in scholarship seats (from 207 to 179) and a 13.5 decrease in total seats (from 1,820 to 1,575). At the aggregate level, scholarship seats increased by 76.4 (from 322 to 568), primarily due to public sector expansion. However, total medical seats declined slightly by 0.74 (from 2,156 to 2,140), largely due to reduced private sector participation. This number of total seat was 1925 in 2024, making decline of nearly 11.8. MEC (2024) The increase in scholarship seats alongside a reduction in total seats presents economic challenges. Although Nepal now has 25 medical colleges , up from 20, the overall number of seats has declined, raising concerns about resource under-utilization, financial sustainability, and long-term viability. 6 Prabesh Rijal A key driver of this shift is the NMEA mandate requiring public medical colleges to allocate 75 of seats as scholarships, while private institutions must reserve 10, and foreign-funded institutions 20. This policy intervention has dramatically increased the number of government-funded scholarships. This expansion of government-funded medical education presents critical economic and policy questions: Is this model sustainable for Nepals economy? While the NMEA has undoubtedly improved access to medical education through scholarships, the broader economic and institutional impacts require deeper analysis. Scholarship Spending Analysis Table 2: Cost of Scholarship (2014 and 2025) Analysis Category 20142025  Change Public Institutions - Scholarship Seats 115389 238.3 - Scholarship Cost 51.18 crore1.73 arab Private Institutions - Scholarship Seats 207179 -13.5 - Scholarship Cost 92.126 crore79.7 crore Total Scholarship Cost 1.443 arab2.527 arab76.4 Note: Cost per seat  NPR 44,50,831 (current approximate MBBS fee in Nepal). Scholarship cost is calculated based on the worth of the prevailing MBBS fee. The governments expenditure on medical scholarships for public institutions surged by 238.3, reflecting a significant policy shift toward public medical education. Four new public colleges were established post-NMEA, contributing to this expansion. While this investment has increased accessibility, it has also imposed a substantial financial burden. Meanwhile, private institutions saw a 13.5 reduction in both scholarship seats and associated costs, highlighting their declining role in medical education. Despite the overall 76.4 increase in total scholarship costs, the number of total medical seats declined by 0.74, raising concerns about sustainability due to sudden changes.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 3,
    "token_count": 778,
    "char_count": 3616,
    "id": "fba9c008-c8de-4fce-8546-cddf259a58ee"
  },
  {
    "content": "crore1.73 arab Private Institutions - Scholarship Seats 207179 -13.5 - Scholarship Cost 92.126 crore79.7 crore Total Scholarship Cost 1.443 arab2.527 arab76.4 Note: Cost per seat  NPR 44,50,831 (current approximate MBBS fee in Nepal). Scholarship cost is calculated based on the worth of the prevailing MBBS fee. The governments expenditure on medical scholarships for public institutions surged by 238.3, reflecting a significant policy shift toward public medical education. Four new public colleges were established post-NMEA, contributing to this expansion. While this investment has increased accessibility, it has also imposed a substantial financial burden. Meanwhile, private institutions saw a 13.5 reduction in both scholarship seats and associated costs, highlighting their declining role in medical education. Despite the overall 76.4 increase in total scholarship costs, the number of total medical seats declined by 0.74, raising concerns about sustainability due to sudden changes. Key Data on Medical Scholarship Spending 1.Total Education Scholarship Budget : NPR 7.38 Arab (for 15.71 lakh students ) 2.Medical Education Share : NPR 5.11 Arab ( 69.2 of total scholarship budget , for 10,584 students) Per-student cost (Medical) : NPR 4.83 lakh 7 Prabesh Rijal Per-student cost (General) : NPR 4,698 (100x lower) 3.MBBS Scholarships : NPR 1.73 Arab (23.4 of total scholarship budget , for 389 students) Per-student cost: NPR 44.5 lakh 4.MBBS  BDS Scholarships : NPR 1.85 Arab ( 25.1 of total scholarship budget , for 445 students) Per-student cost: NPR 41.57 lakh (Source: MoEST, 2081) As per the budget for 2024-25, the education ministrys budget is NPR 236.6 Arab; this calculates to around 0.7 for MBBS scholarships in public institutes and around 2.16 of education ministry budget on medical education scholarship. To provide context, the budget for technical education under CTEVT is NPR 1.59 Arab, less than the NPR 1.78 Arab designated for MBBS scholarships. As mentioned, the government plans to allocate around 23.4 of Nepals education scholarship budget to just 389 MBBS studentsa single undergraduate program. This disproportionate investment poses an economic risk, especially considering the significant migration of doctors, as analyzed in the reports chapter Investing in Departure . Overregulated  Ignored Private Sector : The National Medical Education Act (2018) introduced a series of reforms to regulate Nepals medical education sector, heavily influenced by Dr. Govinda KCs activism. These reforms have particularly impacted private medical colleges, which currently account for 73.6 of total student enrollments. Of the 2,140 medical seats available in 2025, 1,575 are allocated to private institutions, making them central stakeholders in this sector. Key Provisions of the Act: Seat Reduction: Private medical colleges, which previously offered up to 150 seats each, are now limited to a maximum of 100 under the revised regulations, influenced by Dr. KCs activism. In 2025, 17 private colleges collectively hold 1,575 seats, compared to 1,820 seats offered by 16 colleges around 2014-15 (see Annex 1). Ban on New Colleges in Kathmandu: A 10-year moratorium has been placed on establishing new private medical colleges in the Kathmandu Valley to prevent oversaturation. Affiliation Limits: Universities are restricted from affiliating with more than five medical colleges, aiming to maintain academic standards. Hospital Requirement: Private medical colleges must operate a hospital for at least three years before offering academic programs, with a minimum of 300 beds for MBBS and 100 beds for dental and nursing programs. 8 Prabesh Rijal Mandatory Scholarships: Private medical colleges must allocate 10 of seats for scholarships, increasing to 20 if the institution has foreign investment. These measures were intended to enhance educational quality and affordability while preventing commercialization. However, it is important to remember that private medical colleges are key stakeholders; they contribute investment, bring in technology, and also provide scholarships. Foreign and Private Investment Trends: Nepal has seen minimal Foreign Direct Investment (FDI) in medical education. The College of Medical Sciences (est. 1993) and Manipal College of Medical Sciences (est. 1994) are the only two foreign-invested institutions, both required to allocate 20 of seats for scholarships. Since then, no new foreign-funded medical colleges have been established, indicating a long wait and raising concerns about the effectiveness of current policies.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 4,
    "token_count": 993,
    "char_count": 4596,
    "id": "fdf0d432-5ecb-4fda-9b51-e9a033e93c5e"
  },
  {
    "content": "three years before offering academic programs, with a minimum of 300 beds for MBBS and 100 beds for dental and nursing programs. 8 Prabesh Rijal Mandatory Scholarships: Private medical colleges must allocate 10 of seats for scholarships, increasing to 20 if the institution has foreign investment. These measures were intended to enhance educational quality and affordability while preventing commercialization. However, it is important to remember that private medical colleges are key stakeholders; they contribute investment, bring in technology, and also provide scholarships. Foreign and Private Investment Trends: Nepal has seen minimal Foreign Direct Investment (FDI) in medical education. The College of Medical Sciences (est. 1993) and Manipal College of Medical Sciences (est. 1994) are the only two foreign-invested institutions, both required to allocate 20 of seats for scholarships. Since then, no new foreign-funded medical colleges have been established, indicating a long wait and raising concerns about the effectiveness of current policies. Strict regulations, limited seat capacity, and government control over fees may have deterred further investment by restricting revenue potential. Domestic private investment has also faced challenges. The BC Medical College Teaching Hospital and Research Centre recently received approval to offer an MBBS program. Since 2014, only one new private medical college has been added, while four new public medical colleges have been established: Rapti Academy of Health Sciences, Pokhara Academy of Health Sciences, Karnali Academy of Health Sciences, and Madhesh Institute of Health Sciences, with Geta Medical College soon to follow. KC has advocated for the rapid expansion of public institutions and has openly opposed private medical colleges receiving a letter of intent, as seen with BC. While highlighting concerns over investor-driven motives and profit-oriented practices in medical education, it is also important to recognize the private sectors significant contribution, which currently enrolls 73 of students and provides nearly 32 of total scholarships. KC had called for a 1:3 ratio of public to private medical colleges, but the post-reform trend has shifted closer to a 4:1 ratio, signaling a significant deviation from his own demand. This raises concerns about whether the stringent regulations have made it too difficult for the private sector to operate effectively. It may be time to reconsider the balance between oversight and flexibility to ensure accessibility and sustainability in medical education. Lost Scholarship Opportunities: In 2014-2015, 16 private medical colleges awarded scholarships to 207 students, averaging 12.94 students per institution. However, by 2025, 17 colleges collectively awarded scholarships to only 179 students, averaging 10.53 students per institutiona decline of around 2.41 students per institution. The reduction in seats and the lack of new private colleges have resulted in fewer scholarship opportunities for students. Misalignment in Requirements: Nepal mandates that medical colleges have a minimum of 300 hospital beds to run an MBBS program, a requirement similar to Indias Minimum Requirements for Annual MBBS Admissions 9 Prabesh Rijal Regulations (2020), where 300-350 beds are required. An exception is made for the Northeast, where 250 beds are permitted due to lower population density. Assam, the most densely populated state in Northeast India, has 398 people per square km, while Nepals national average is 198 people per square km as per census 2021. This discrepancy raises questions about whether Nepals hospital bed requirements for medical colleges align with the actual healthcare demand and the countrys economic realities. While all these reforms aimed to improve regulation and quality, they have also restricted private sector flexibility, potentially discouraging investment and slowing overall growth in medical education. Investing in Departure: Nepals healthcare education sector has undergone significant changes with the introduction of the Nepal Medical Education Act (NMEA). However, it now faces a growing challenge: a large number of newly trained healthcare professionals, particularly doctors, are migrating abroad in search of better opportunities. This emigration undermines the effectiveness of policies and investments intended to strengthen the healthcare sector. In this analysis, we explore the economic implications of this trend, considering Nepal's socio-economic context, and argue that these factors must be incorporated into the development of human capital investment policies. Nepals health sector presents a paradox of progress and peril. Between 2010/11 and 2023/24, the doctor-patient ratio surged from 0.04 to 1.20 per thousand, and the nurse-patient ratio increased from 0.23 to 2.83surpassing WHO benchmarks, as per the Economic Survey Report 2080-81. Table 3: Total Registration Status till Dec 2023.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 5,
    "token_count": 946,
    "char_count": 4979,
    "id": "7c0b7236-c113-448b-aff8-be964e8b8da8"
  },
  {
    "content": "ure: Nepals healthcare education sector has undergone significant changes with the introduction of the Nepal Medical Education Act (NMEA). However, it now faces a growing challenge: a large number of newly trained healthcare professionals, particularly doctors, are migrating abroad in search of better opportunities. This emigration undermines the effectiveness of policies and investments intended to strengthen the healthcare sector. In this analysis, we explore the economic implications of this trend, considering Nepal's socio-economic context, and argue that these factors must be incorporated into the development of human capital investment policies. Nepals health sector presents a paradox of progress and peril. Between 2010/11 and 2023/24, the doctor-patient ratio surged from 0.04 to 1.20 per thousand, and the nurse-patient ratio increased from 0.23 to 2.83surpassing WHO benchmarks, as per the Economic Survey Report 2080-81. Table 3: Total Registration Status till Dec 2023. Course Male FemaleTotal MBBS 19954 1007330027 BDS 1727 31564883 MD/MS 7063 27609823 MDS 404 361765 Source: Nepal Medical Council The country has invested heavily in medical education, producing 30,027 MBBS and 4,883 BDS graduates (34,910 total), alongside 9,823 MD/MS and 765 MDS specialists. Yet, this is marred by a significant outflow of medical professionals. Between 2020 and 2023, 74 of newly registered doctors (6,368 out of 8,624) applied for certificates to work abroad. In 2022 alone, 93.7 of new doctors emigrated. Table 4: Registration Vs Migration YearNewly Registered Doctors Doctors Leaving Abroad Proportion () 20202131 769 36.1 20211716 1327 77.3 20222085 1954 93.7 20232692 2318 86.1 Source: Koirala, A. 10 Prabesh Rijal The direct fiscal loss from the emigration of scholarship-funded doctors can be estimated based on several assumptions. Out of 2,000 newly registered doctors (aligned with the number of MBBS seats in 2023), it can be assumed that 500 have scholarship-funded seats, with 350 attending public medical colleges. Given recent trends, it is assumed that 80 of these doctors will migrate abroad. The cost of MBBS training is estimated at NPR 44 lakh. Therefore, 400 scholarship-funded doctors (80 of 500) are expected to emigrate, resulting in a fiscal loss of NPR 176 crore (400 doctors  NPR 44 lakh). Specifically, the fiscal loss attributed to government-funded doctors is estimated at NPR 123.2 crore (350 doctors  NPR 44 lakh). This calculation is just to highlight the gravity of the issue. It only accounts for the direct training costs of emigrating doctors and does not factor in broader economic impacts, such as gaps in healthcare services, productivity losses, or diminished innovation within the healthcare sector. As discussed in the chapter \"The Burden of Scholarship,\" with the government planning to allocate 23.4 of Nepals education scholarship budget (NPR 173 crore) to just 389 MBBS students in a single undergraduate program, coupled with this trend of migration, it raises serious concerns about the return on investment (RoI) of such a substantial government expenditure. Decline of Nursing Colleges: One of the central demands made by Dr. Govinda KC during his hunger strike was the closure of medical and nursing colleges that failed to meet regulatory standards he had set and advocated for. In response, the National Medical Education Act introduced a provision requiring nursing colleges to operate a 100-bed hospital, which led to the closure of 78 nursing institutions in Nepal, as reported in 2022 (Nepal Press, 2023) . This policy shift has had a profound impact on nursing and dental sciences education, resulting in a sharp decline in certificate-level enrollments across both fields. Table 5: Enrollment Trends in Certificate level Nursing and Dental Education YearCertificate level nursing Certificate level dental science 2075/764067 526 2076/774067 343 2077/784053 328 2078/791632 341 2080/812078 336 Source: CTEVT (2081) The enrollment in certificate-level nursing courses dropped by 49, from 4,067 in 2075/76 to 2,078 in 2080/81. The most significant decrease occurred between 2077/78 (4,053) and 2078/79 (1,632), following the implementation of the Medical Education Act.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 6,
    "token_count": 982,
    "char_count": 4236,
    "id": "a93a1697-6a92-4bc4-a1c9-009f7a16477e"
  },
  {
    "content": "which led to the closure of 78 nursing institutions in Nepal, as reported in 2022 (Nepal Press, 2023) . This policy shift has had a profound impact on nursing and dental sciences education, resulting in a sharp decline in certificate-level enrollments across both fields. Table 5: Enrollment Trends in Certificate level Nursing and Dental Education YearCertificate level nursing Certificate level dental science 2075/764067 526 2076/774067 343 2077/784053 328 2078/791632 341 2080/812078 336 Source: CTEVT (2081) The enrollment in certificate-level nursing courses dropped by 49, from 4,067 in 2075/76 to 2,078 in 2080/81. The most significant decrease occurred between 2077/78 (4,053) and 2078/79 (1,632), following the implementation of the Medical Education Act. Similarly, certificate-level enrollments in dental science also declined by 36, from 526 in 2075/76 to 336 in 2080/81. 11 Prabesh Rijal While the number of registered nurses in Nepal has increased from 14,373 in 2010 to 85,778 in February 2025, only 34,298 have renewed their licenses, highlighting a significant trend of migration abroad, as reported by the Nepal Nursing Council. The economic impact of these changes is considerable. The closure of 78 nursing colleges has deprived 3,120 students of nursing education opportunities annually, as each college typically enrolled 40 students per batch. This has resulted in an estimated economic loss of NPR 5.85 billion, with each closed college having an average investment of NPR 75 million. These closures have not only disrupted private sector investments but also reduced local employment opportunities, especially for faculty and staff. Given that nursing is predominantly a female profession, this decline in nursing education access disproportionately affects womens ability to secure stable jobs and advance in their careers. The Lost Leverage: A key provision in the National Medical Education Act mandates that medical institutions must have their own hospitals to operate medical programs, a standard also advocated by Dr. Govinda KC. While some institutions possess the necessary resources, current regulations prevent them from contracting with hospitals for student training or post-graduation employment opportunities. Section 44 of the Act requires educational institutions to establish their own hospitals within two years of its implementation in 2018, which led to the closure of several institutions unable to meet this requirement. This has resulted in the loss of resources, investment opportunities, and the inability to leverage both private institutions and public hospitals. Strict control over seat allocations, regardless of an institution's investment capacity, has led to an inelastic approach that has negatively impacted foreign direct investment (FDI). Nepal had the potential to become a regional hub for medical studies, especially considering the high demand in India, where over 1.1 million students annually take the NEET exam, yet fewer than 10 gain admission. This presents a clear market opportunity for Nepal. Section 17(5) of the Act currently allows one-third of seats to be allocated to foreign students. Increasing the total number of seats, coupled with this policy, could have been advantageous. However, the rigidity of regulations has hindered much-needed investment, particularly from the private sector. Domestically, only 19 of those who pass the Common Entrance Exam (CEE) in Nepal secure a seat for MBBS, with just 1,544 seats available for Nepali students. There is clear demand both domestically and internationally, but investment is crucial. The private sector must play a key role in addressing this gap. As reported by the Press Information Bureau (2023), India increased its MBBS seats by 110 from 2014 to 2023, while Nepal has seen a decrease of 0.74 from 2015 to 2025. The question remains: who will fill this gap? It is the private sector, particularly in an economy like Nepals, that can help meet this growing demand. To do so, the regulatory environment must evolve to allow greater flexibility, benefiting both the education system and the broader economy, especially since medical education is a cost-intensive sector. 12 Prabesh Rijal Policy Recommendations: 1)Expand Intake Capacity: The number of medical seats must increase, particularly in the private sector, as government expenditure is already significant, to meet both domestic demand and capitalize on international potential . While scholarship seats have surged by nearly 76.4 from 20142015 to 2025 , overall intake has declined by 0.74. MEC (2025) has reported a demand of 2,620 seats for 2025, while the total number of seats allotted is 2,140.",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 7,
    "token_count": 990,
    "char_count": 4696,
    "id": "5fbe2a66-0c2e-4453-86f8-51effde8de75"
  },
  {
    "content": "has seen a decrease of 0.74 from 2015 to 2025. The question remains: who will fill this gap? It is the private sector, particularly in an economy like Nepals, that can help meet this growing demand. To do so, the regulatory environment must evolve to allow greater flexibility, benefiting both the education system and the broader economy, especially since medical education is a cost-intensive sector. 12 Prabesh Rijal Policy Recommendations: 1)Expand Intake Capacity: The number of medical seats must increase, particularly in the private sector, as government expenditure is already significant, to meet both domestic demand and capitalize on international potential . While scholarship seats have surged by nearly 76.4 from 20142015 to 2025 , overall intake has declined by 0.74. MEC (2025) has reported a demand of 2,620 seats for 2025, while the total number of seats allotted is 2,140. Private sector seats have dropped from 150 to a maximum of 100 and should be determined based on institutional capacity. Increasing the total number of seats, along with the existing provision of allocating one-third to foreign students, could have enhanced revenue generation for medical colleges. 2)Balancing Healthcare Scholarship Allocation: The current distribution of Nepals education scholarship budget shows a disproportionate allocation to MBBS students, with 23.4 of the total scholarship budget directed towards just 389 MBBS students. To ensure a more equitable distribution of resources and better value for taxpayer investments, the government should consider redistributing a portion of the scholarship funds from MBBS programs to other critical healthcare sectors, such as nursing, paramedics, public health, or even non-medical sectors. Investing in these areas could help address healthcare gaps, reduce the economic risk of brain drain in the medical profession, and improve the overall effectiveness of Nepals education scholarship budget. 3)Reevaluate Infrastructure Requirements: Current regulations, such as the 300-bed hospital requirement for MBBS programs under Section 12(1)(a), should be revised, considering Nepals lower population density. Differentiated requirements for metropolitan areas versus smaller municipalities, or for institutions inside versus outside the Kathmandu Valley, could create a more practical framework. A dynamic requirement plan, similar to India's Minimum Requirements for Annual MBBS Admissions Regulations, should be developed, considering factors like intake capacity, hospital beds, infrastructure, occupancy, and demographic area specifics. 4)Strengthen Hospital-College Collaboration: Section 44 should be reformed to allow long- term, sustainable contracts between medical colleges and hospitals. This would optimize the use of public resources, private investments, and human capital, preventing college closures, resource underutilization, and reduced accessibility to medical education. 5)Balanced Approach to Non-Profit Medical Education: While Section 47 aims to transition medical education into a non-profit model, a regulated and incentivized private sector should be accommodated. Private participation brings necessary investments and technological advancements, which should be encouraged within a structured regulatory framework. After the NMEA, the private sectors emergence has not been satisfactory, as only one medical college with 50 seats has been added. The government needs to invest significantly in both infrastructure and scholarship costs. Given the economic situation, the 13 Prabesh Rijal private sector needs to be encouraged, possibly through flexible requirements, seat increments, etc. 6)Address Brain Drain  Scholarship ROI: With significant public investment in medical scholarships, the ongoing mass migration of doctors raises concerns about return on investment (ROI). As highlighted, the ratio of newly registered doctors to those migrating is alarming. The government must reassess scholarship terms, potentially increasing bond duration or implementing a dynamic model where scholarship percentages correlate with service bond years, ensuring long-term benefits for Nepals healthcare sector. Additionally, Nepal's socio-economic context, such as increasing migration, must be considered when developing human capital investment policies, especially due to the cost-heavy nature of medical education. Conclusion While Dr. KC's reforms have brought about some positive developments, there are still significant challenges to be addressed. The government must reconsider the balance between regulation and flexibility to create a more conducive environment for both public and private sector growth. References Bhattarai, B. Non-Violent Action to Reform Medical Education in Nepal: The Fasts- unto-death of Dr. Govinda KC . Retrieved from https://www.researchgate.net/publication/343536506_NonViolent_Action_to_Reform_Medi cal_Education_in_Nepal_-The_Fasts-unto-death_of_Dr_Govinda_KC National Medical Education Act (2018) Medical Education Commission. Retrieved from https://www.mec.gov.np/uploads/shares/ActandRegulation/national_medical_education_acts _2018_.pdf Nepal Press. Government's stance on medical education reforms .",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 8,
    "token_count": 992,
    "char_count": 5221,
    "id": "8ab8d98d-2252-4441-8fc0-e9b2620774e1"
  },
  {
    "content": "considered when developing human capital investment policies, especially due to the cost-heavy nature of medical education. Conclusion While Dr. KC's reforms have brought about some positive developments, there are still significant challenges to be addressed. The government must reconsider the balance between regulation and flexibility to create a more conducive environment for both public and private sector growth. References Bhattarai, B. Non-Violent Action to Reform Medical Education in Nepal: The Fasts- unto-death of Dr. Govinda KC . Retrieved from https://www.researchgate.net/publication/343536506_NonViolent_Action_to_Reform_Medi cal_Education_in_Nepal_-The_Fasts-unto-death_of_Dr_Govinda_KC National Medical Education Act (2018) Medical Education Commission. Retrieved from https://www.mec.gov.np/uploads/shares/ActandRegulation/national_medical_education_acts _2018_.pdf Nepal Press. Government's stance on medical education reforms . Retrieved from https://www.nepalpress.com/2023/07/13/349288/ Khabarhub. KC warns of another hunger strike over medical education reform. Retrieved from https://english.khabarhub.com/2024/16/356041/ Gautam, D. क सकभकआनदलन, सननसरकरल. Retrieved from https://shilapatra.com/detail/96053 Gautam, M. KC signs an 11-point agreement with the government. Retrieved from https://kathmandupost.com/miscellaneous/2015/09/05/drkc-signs-an-11-point- agreement-with-the-government Baral, B. Medical colleges charging high fees may soon face government action . The Kathmandu Post. Retrieved from 14 Prabesh Rijal https://kathmandupost.com/national/2019/04/29/medical-colleges-charging-high-fees-may- soon-face-government-action MEC. Undergraduate Seat Allocation 2024 . Retrieved from https://www.mec.gov.np/uploads/shares/ug2024/ug_2024__seats.pdf MEC. Undergraduate Seat Allocation 2025 . Retrieved from https://www.pdch.com.np/public/uploads/Notice/MEECE-BL20202520Seat.pdf Minimum requirements for annual MBBS admissions regulations (2020) . Retrieved from https://www.nmc.org.in/rules-regulations/minimum-requirements-for-annual-m-b-b-s- admissions-regulation2020/ Koirala, A. Doctors flee: Statistics warn . Retrieved from https://ekantipur.com/en/opinion/2025/01/16/doctors-flee-statistics-warn-22-47.html CTEVT (2081). CTEVT Annual Report . Retrieved from https://ctevt.org.np/documents/annual-report-updated-upto-2081 Press Information Bureau. Government of India s reforms in medical education .",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 9,
    "token_count": 617,
    "char_count": 2442,
    "id": "12a4f0ac-f444-49b8-9a14-f0b214428ed7"
  },
  {
    "content": "Allocation 2024 . Retrieved from https://www.mec.gov.np/uploads/shares/ug2024/ug_2024__seats.pdf MEC. Undergraduate Seat Allocation 2025 . Retrieved from https://www.pdch.com.np/public/uploads/Notice/MEECE-BL20202520Seat.pdf Minimum requirements for annual MBBS admissions regulations (2020) . Retrieved from https://www.nmc.org.in/rules-regulations/minimum-requirements-for-annual-m-b-b-s- admissions-regulation2020/ Koirala, A. Doctors flee: Statistics warn . Retrieved from https://ekantipur.com/en/opinion/2025/01/16/doctors-flee-statistics-warn-22-47.html CTEVT (2081). CTEVT Annual Report . Retrieved from https://ctevt.org.np/documents/annual-report-updated-upto-2081 Press Information Bureau. Government of India s reforms in medical education . Retrieved from https://pib.gov.in/PressReleaseIframePage.aspx?PRID1947690 15 Prabesh Rijal ANNEX Annex1: Seats and Scholarship before and after NMEA S.N.Colleges UniTypeScholarship Seat 2014Total Seats 2014Scholarship Seat 2025Total Seats 2025 1Kathmandu Medical College, Sinamangal, Ktm KUPrivate1515010100 2Nepal Medical College KUPrivate1515010100 3College of Medical Science Bharatpur, Chitwan KUPrivate3015020100 4Manipal College of Medical Science, Pokhara KUPrivate2613020100 5Nepalgunj Medical College Nepalgunj KUPrivate1515010100 6Lumbini Medical College Palpa KUPrivate1010010100 7KUSMS, Dhulikhel KUPrivate16010100 8Nobel Medical College, Biratnagar KUPrivate1515010100 9Institute of Medicine (IOM) Maharajgunj, Ktm TUPublic477675100 10KIST Medical College, Imadol, Lalitpur TUPrivate87510100 11Universal College of Medical Science, Bhairahawa TUPrivate1515010100 12National Medical College, Birgunj TUPrivate1515010100 13Janaki Medical College, Janakpur TUPrivate880550 14Chitwan Medical College, Bharatpur, Chitwan TUPrivate1414010100 15Gandaki Medical College, Pokhara TUPrivate87510100 16Nepalese Army Institute of Health Science, Ktm TUPublic2510038100 17BPKIHS Dharan BPKIHSPublic3310075100 18Patan Academy of Health Science (PAHS) PAHSPublic10604965 19Birat Medical College 2015 KUPrivate77010100 20Devdaha Medical College2015 KUPrivate540975 NMEA impact 32221564111890 21Karnali Academy of Medical Sciences Public 3850 22Rapti Academy of Health Science Public Added only in 20253850 23Pokhara Academy of Health Sciences Public 3850 24Madhesh Institute of Health Sciences Public 3850 25B  C medical colleges Private 550 TOTAL32221565682140 Source: Medical Education Commission and IOM, MOE, KU, BPKHIS, P AHS 16 Prabesh Rijal 17 Prabesh Rijal",
    "source": "Anshan_Paradox.pdf",
    "chunk_index": 10,
    "token_count": 773,
    "char_count": 2516,
    "id": "7b6fc80e-09ca-4f4a-a0aa-e23b948fa275"
  },
  {
    "content": "Prabesh_rjMenuThoughtsNepalShortsBeyond the Stack:Of Minds and MattersJune 10, 2025Nepals Remittance-Consumption TrapOver the past two decades, remittances have emerged as the lifeblood of Nepals economy. In 2024, remittance inflows reached an all-time high, accounting for nearly 25 of the countrys GDPamong the highest ratios globally. On the surface, this appears to be a great success: ourContinue reading...April 3, 2025We didn't sign up for thisThis thought has lingered in the air around me for some time, but today I feel compelled to put it into words. Does it matter? I don't know. But theres something unsettling about how quickly weve changed as a species in such a short span of time.Continue reading... Anonymous and Hidden.Appreciations and Critiques  all welcomed.Send  2025 Prabesh Rijal  These writings are righted.",
    "source": "URL: https://rijalprabesh.com.np/",
    "chunk_index": 0,
    "token_count": 206,
    "char_count": 833,
    "id": "bb42874d-71e6-4e9b-9282-c6f54c017554",
    "source_url": "https://rijalprabesh.com.np/"
  }
]